# **31. 자동차 종류별 특정 옵션이 포함된 자동차 수 구하기(250227)(GROUP BY)**

In [ ]:
# 문제 설명
# 다음은 어느 자동차 대여 회사에서 대여중인 자동차들의 정보를 담은 CAR_RENTAL_COMPANY_CAR 테이블입니다.
# CAR_RENTAL_COMPANY_CAR 테이블은 아래와 같은 구조로 되어있으며, CAR_ID, CAR_TYPE, DAILY_FEE, OPTIONS 는
# 각각 자동차 ID, 자동차 종류, 일일 대여 요금(원), 자동차 옵션 리스트를 나타냅니다.

# Column name	Type	Nullable
# CAR_ID	INTEGER	FALSE
# CAR_TYPE	VARCHAR(255)	FALSE
# DAILY_FEE	INTEGER	FALSE
# OPTIONS	VARCHAR(255)	FALSE
# 자동차 종류는 '세단', 'SUV', '승합차', '트럭', '리무진' 이 있습니다.
# 자동차 옵션 리스트는 콤마(',')로 구분된 키워드 리스트(옵션 리스트 값 예시: '열선시트', '스마트키', '주차감지센서')로 되어있으며,
# 키워드 종류는 '주차감지센서', '스마트키', '네비게이션', '통풍시트', '열선시트', '후방카메라', '가죽시트' 가 있습니다.

# 문제
# CAR_RENTAL_COMPANY_CAR 테이블에서 '통풍시트', '열선시트', '가죽시트' 중 하나 이상의 옵션이 포함된 자동차가
# 자동차 종류 별로 몇 대인지 출력하는 SQL문을 작성해주세요.
# 이때 자동차 수에 대한 컬럼명은 CARS로 지정하고, 결과는 자동차 종류를 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 CAR_RENTAL_COMPANY_CAR 테이블이 다음과 같다면

# CAR_ID	CAR_TYPE	DAILY_FEE	OPTIONS
# 1	세단	16000	가죽시트,열선시트,후방카메라
# 2	SUV	14000	스마트키,네비게이션,열선시트
# 3	SUV	22000	주차감지센서,후방카메라
# 4	트럭	35000	주차감지센서,네비게이션,열선시트
# 5	SUV	16000	가죽시트,네비게이션,열선시트,후방카메라,주차감지센서
# '통풍시트', '열선시트', '가죽시트' 중 하나 이상의 옵션이 포함된 자동차는 자동차 ID가 1, 2, 4, 5인 자동차이고,
# 자동차 종류 별로 몇 대인지 구하고 자동차 종류를 기준으로 오름차순 정렬하면 다음과 같은 결과가 나와야 합니다.

# CAR_TYPE	CARS
# SUV	2
# 세단	1
# 트럭	1

1) 내가 쓴 코드

In [ ]:
# SELECT CAR_TYPE, COUNT(*) AS CARS
# FROM CAR_RENTAL_COMPANY_CAR
# WHERE OPTIONS LIKE '%통풍시트%'
#    OR OPTIONS LIKE '%열선시트%'
#    OR OPTIONS LIKE '%가죽시트%'
# GROUP BY CAR_TYPE
# ORDER BY CAR_TYPE;

# **32. 조건에 맞는 도서와 저자 리스트 출력하기(250303)(JOIN)**

In [ ]:
# 문제 설명
# 다음은 어느 한 서점에서 판매중인 도서들의 도서 정보(BOOK), 저자 정보(AUTHOR) 테이블입니다.

# BOOK 테이블은 각 도서의 정보를 담은 테이블로 아래와 같은 구조로 되어있습니다.

# Column name	Type	Nullable	Description
# BOOK_ID	INTEGER	FALSE	도서 ID
# CATEGORY	VARCHAR(N)	FALSE	카테고리 (경제, 인문, 소설, 생활, 기술)
# AUTHOR_ID	INTEGER	FALSE	저자 ID
# PRICE	INTEGER	FALSE	판매가 (원)
# PUBLISHED_DATE	DATE	FALSE	출판일
# AUTHOR 테이블은 도서의 저자의 정보를 담은 테이블로 아래와 같은 구조로 되어있습니다.

# Column name	Type	Nullable	Description
# AUTHOR_ID	INTEGER	FALSE	저자 ID
# AUTHOR_NAME	VARCHAR(N)	FALSE	저자명
# 문제
# '경제' 카테고리에 속하는 도서들의 도서 ID(BOOK_ID), 저자명(AUTHOR_NAME), 출판일(PUBLISHED_DATE) 리스트를 출력하는 SQL문을 작성해주세요.
# 결과는 출판일을 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 BOOK 테이블과 AUTHOR 테이블이 다음과 같다면

# BOOK_ID	CATEGORY	AUTHOR_ID	PRICE	PUBLISHED_DATE
# 1	인문	1	10000	2020-01-01
# 2	경제	1	9000	2021-04-11
# 3	경제	2	11000	2021-02-05
# AUTHOR_ID	AUTHOR_NAME
# 1	홍길동
# 2	김영호
# '경제' 카테고리에 속하는 도서는 도서 ID가 2, 3인 도서이고, 출판일을 기준으로 오름차순으로 정렬하면 다음과 같은 결과가 나와야 합니다.

# BOOK_ID	AUTHOR_NAME	PUBLISHED_DATE
# 3	김영호	2021-02-05
# 2	홍길동	2021-04-11
# 주의사항
# PUBLISHED_DATE의 데이트 포맷이 예시와 동일해야 정답처리 됩니다.

1) 내가 쓴 코드(오답)

In [ ]:
# SELECT BOOK_ID, AUTHOR_NAME, DATE_FORMAT(PUBLISHED_DATE, '%Y-%m-%d')
# FROM BOOK b left outer join AUTHOR a
# on b.BOOK_ID = a.BOOK_ID
# WHERE CATEGORY = '경제'
# ORDER BY PUBLISHED_DATE

2) gpt 개선코드

In [ ]:
# SELECT b.BOOK_ID, a.AUTHOR_NAME, DATE_FORMAT(b.PUBLISHED_DATE, '%Y-%m-%d') AS PUBLISHED_DATE
# FROM BOOK b
# JOIN AUTHOR a ON b.AUTHOR_ID = a.AUTHOR_ID
# WHERE b.CATEGORY = '경제'
# ORDER BY b.PUBLISHED_DATE;

# **33. 상품별 오프라인 매출 구하기(250304)(JOIN)**

In [ ]:
# 문제 설명
# 다음은 어느 의류 쇼핑몰에서 판매중인 상품들의 상품 정보를 담은 PRODUCT 테이블과 오프라인 상품 판매 정보를 담은 OFFLINE_SALE 테이블 입니다.
# PRODUCT 테이블은 아래와 같은 구조로 PRODUCT_ID, PRODUCT_CODE, PRICE는 각각 상품 ID, 상품코드, 판매가를 나타냅니다.

# Column name	Type	Nullable
# PRODUCT_ID	INTEGER	FALSE
# PRODUCT_CODE	VARCHAR(8)	FALSE
# PRICE	INTEGER	FALSE
# 상품 별로 중복되지 않는 8자리 상품코드 값을 가지며, 앞 2자리는 카테고리 코드를 의미합니다.

# OFFLINE_SALE 테이블은 아래와 같은 구조로 되어있으며 OFFLINE_SALE_ID, PRODUCT_ID, SALES_AMOUNT, SALES_DATE는 각각 오프라인 상품 판매 ID, 상품 ID, 판매량, 판매일을 나타냅니다.

# Column name	Type	Nullable
# OFFLINE_SALE_ID	INTEGER	FALSE
# PRODUCT_ID	INTEGER	FALSE
# SALES_AMOUNT	INTEGER	FALSE
# SALES_DATE	DATE	FALSE
# 동일한 날짜, 상품 ID 조합에 대해서는 하나의 판매 데이터만 존재합니다.

# 문제
# PRODUCT 테이블과 OFFLINE_SALE 테이블에서 상품코드 별 매출액(판매가 * 판매량) 합계를 출력하는 SQL문을 작성해주세요.
# 결과는 매출액을 기준으로 내림차순 정렬해주시고 매출액이 같다면 상품코드를 기준으로 오름차순 정렬해주세요.

# 예시
# 예를 들어 PRODUCT 테이블이 다음과 같고

# PRODUCT_ID	PRODUCT_CODE	PRICE
# 1	A1000011	15000
# 2	A1000045	8000
# 3	C3000002	42000
# OFFLINE_SALE 테이블이 다음과 같다면

# OFFLINE_SALE_ID	PRODUCT_ID	SALES_AMOUNT	SALES_DATE
# 1	1	2	2022-02-21
# 2	1	2	2022-03-02
# 3	3	3	2022-05-01
# 4	2	1	2022-05-24
# 5	1	2	2022-07-14
# 6	2	1	2022-09-22
# 각 상품 별 총 판매량과 판매가는 다음과 같습니다.

# PRODUCT_CODE 가 A1000011인 상품은 총 판매량이 6개, 판매가가 15,000원
# PRODUCT_CODE 가 A1000045인 상품은 총 판매량이 2개, 판매가가 8,000원
# PRODUCT_CODE 가 C3000002인 상품은 총 판매량이 3개, 판매가가 42,000원
# 그러므로 각 상품 별 매출액을 계산하고 정렬하면 결과가 다음과 같이 나와야 합니다.

# PRODUCT_CODE	SALES
# C3000002	126000
# A1000011	90000
# A1000045	16000

1) 내가 쓴 코드

In [ ]:
# SELECT p.PRODUCT_CODE, SUM(p.PRICE * o.SALES_AMOUNT) AS SALES
# FROM PRODUCT p
# JOIN OFFLINE_SALE o ON p.PRODUCT_ID = o.PRODUCT_ID
# GROUP BY p.PRODUCT_CODE
# ORDER BY SALES DESC, p.PRODUCT_CODE ASC;